load-test/pilot.yml
# RIO-NFR-006 / RIO-NFR-005 — pilot-volume load test.
#
# Proves the scalability claim (row-per-entity multitenancy + per-request RLS +
# bounded pagination hold up at pilot volume) by driving realistic
# login -> read/write traffic against a running API seeded with ~50 orgs / ~500 users.
#
# RIO-NFR-005 (Round 5, client-confirmed 2026-08-24): the pilot target is 500
# *concurrent* sessions, not 500 total registered accounts. The phases below
# are sized so Artillery's own steady-state concurrent-VU count (reported as
# `vusers.active` in the run summary / report.json) reaches ~500 during the
# sustained phase — arrivalRate x average-session-duration, not just the
# arrival rate on its own. The 500 seeded accounts (load-seed.ts) are reused
# across concurrent sessions, same as a real deployment reusing a fixed set
# of NGO accounts.
#
# Run:  pnpm load:seed          # seed pilot volume + write users.csv
#       PORT=4100 node dist/main.js   # start the API (built) on :4100
#       pnpm test:load           # this file
#
# The read steps (me / organizations / users / audit) each run inside a
# per-request RLS transaction — that is what "scales without rebuild" must hold
# under concurrency. Login (argon2id verify) runs once per virtual user, then
# the token is reused across the read loop so the fixed auth cost does not
# dominate the measurement.
#
# Two scenarios share the same phases (Artillery samples by `weight`):
#   - auth-then-reads (weight 80): unchanged read-only loop.
#   - auth-then-write (weight 20): same reads, plus one idempotent write per
#     iteration (PATCH own user record's `name` back to its already-seeded
#     value) — exercises the write path's per-request RLS + permission-guard
#     cost under concurrency, without mutating data in a way that would need
#     cleanup between runs.
#
# NOT covered here (documented as a known gap, not simulated): a bounded
# CSV/Excel survey-response export under load. That would require seeding a
# published survey with response volume approaching MAX_EXPORTABLE_RESPONSES
# (50_000, see public-surveys.service.ts) — a materially bigger seed script
# than load-seed.ts's org/user fixtures. The 50k cap itself, and the
# formula-injection sanitization applied to every exported cell, are covered
# by real (non-load) tests in public-surveys.service.spec.ts; this file only
# proves request-path scalability, not export-specific memory/latency
# behavior at that volume.
config:
  target: "http://127.0.0.1:4100"
  http:
    timeout: 30
  payload:
    path: "./users.csv"
    fields:
      - "email"
      - "password"
    order: random
    skipHeader: true
  phases:
    - duration: 10
      arrivalRate: 15
      name: warmup
    - duration: 20
      arrivalRate: 15
      rampTo: 210
      name: ramp-to-500-concurrent
    - duration: 60
      arrivalRate: 210
      name: sustained-500-concurrent
  ensure:
    thresholds:
      - http.response_time.p95: 500
    maxErrorRate: 1

scenarios:
  - name: auth-then-reads
    weight: 80
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "token"
          expect:
            - statusCode: 200
      - loop:
          - get:
              url: "/api/auth/me"
              headers:
                Authorization: "Bearer {{ token }}"
              expect:
                - statusCode: 200
          - get:
              url: "/api/organizations/current"
              headers:
                Authorization: "Bearer {{ token }}"
              expect:
                - statusCode: 200
          - get:
              url: "/api/users?limit=20"
              headers:
                Authorization: "Bearer {{ token }}"
              expect:
                - statusCode: 200
          - get:
              url: "/api/audit?limit=20"
              headers:
                Authorization: "Bearer {{ token }}"
              expect:
                - statusCode: 200
          - think: 0.3
        count: 2

  - name: auth-then-write
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "token"
            - json: "$.user.id"
              as: "userId"
            - json: "$.user.name"
              as: "userName"
          expect:
            - statusCode: 200
      - loop:
          - get:
              url: "/api/auth/me"
              headers:
                Authorization: "Bearer {{ token }}"
              expect:
                - statusCode: 200
          - get:
              url: "/api/users?limit=20"
              headers:
                Authorization: "Bearer {{ token }}"
              expect:
                - statusCode: 200
          # Idempotent write: PATCHes the caller's own name back to its
          # already-seeded value, so repeated iterations never drift the
          # fixture data — but still exercises the write path's
          # RequirePermission guard + per-request RLS transaction.
          - patch:
              url: "/api/users/{{ userId }}"
              headers:
                Authorization: "Bearer {{ token }}"
              json:
                name: "{{ userName }}"
              expect:
                - statusCode: 200
          - think: 0.3
        count: 2